import React from "react";
const CNX = () => {
  return (
    <div className="container">
      <h3>เกี่ยวกับ เว็ปไซน์ CNX devsoft</h3>
      <div>
        เนื่องจากโดยรวมถือว่าเป็นเว็ปที่ดีมาก ดีไซน์ดูทันสมัยไม่ตกเทน
        แต่หน้าภาษาอังกฤษมีมากกว่าหน้าภาษาไทยไปนิดหน่อย
        อันนี้ไม่รู้ว่าตั้งใจหรือป่าวนะครับ หน้า About us
        ก็น่าจะยังไม่เสร็จดีด้วยครับ ส่วนใหญ่อาจจะแค่เก็บรายละเอียดบางส่วน
        อย่างเช่นที่คิดว่าจะคลิ๊กได้ก็คลิ๊กไม่ได้
        ตัวหนังสือเมื่อเม้าท์ไปวางทับกลายเป็นสามารถครอบได้
        อาจจะดูแปลกๆในสายดีไซน์เนอร์ครับ
      </div>
    </div>
  );
};

export default CNX;
